Merge pull request #4 from drinksong/feat/skills
Feat/skills
